app/controllers/movies_controller.rb

SELECT rating FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG', 'G', 'R') ORDER BY release_date
---
  def index
    if (params[:ratings] || params[:sort])
      session[:params] = params
    else
      session[:params] ? redirect_to(session[:params]) : {:action=>"index", :controller=>"movies"}
    end
    @all_ratings =Movie.select(:rating).map(&:rating).uniq
    @checked = params[:ratings] ? params[:ratings].keys : @all_ratings
    @movies = Movie.where(:rating=>@checked).order(params[:sort])